[
  {
    "jobId": "nigel_frank_international_a0MaA000000PQKH.11_1749460274",
    "title": "Power Platform Developer",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA000000PQKH.11_1749460274/power-platform-developer",
    "description": "A leading financial services organisation is seeking a Power Platform Developer to join their digital solutions team. This is a fantastic opportunity for a technically skilled and people-oriented professional who enjoys working across the full development lifecycle - gathering requirements, designing solutions, and supporting end users post-deployment. You'll play a key role in delivering modern, efficient, and scalable solutions using Microsoft Power Platform and Dynamics 365 Customer Engagement (CE). This role is mainly remote, with travel to the Oxfordshire office just once per month. This is not just a technical role - it's also customer-facing, so you'll need to be confident working with stakeholders, understanding business needs, and communicating clearly and effectively.",
    "location": "England",
    "country": "United Kingdom",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "Up to £55,000 GBP",
    "skills": [
      "Power Platform",
      "Power Apps",
      "Power Automate",
      "Power BI",
      "Dynamics 365 Customer Engagement",
      "Azure",
      "Microsoft Dynamics CRM",
      "D365 CE",
      "Dataverse",
      "SharePoint",
      "Microsoft 365"
    ],
    "experienceLevel": "intermediate",
    "currency": "GBP",
    "benefits": [
      "Competitive salary up to £55,000 per annum (DOE)",
      "Mainly remote - with only one day per month in the Oxfordshire office",
      "Investment in your professional development",
      "Friendly and collaborative culture with clear career progression",
      "Opportunity to shape impactful digital tools for a respected financial services provider"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Develop and maintain Power Apps (Canvas and Model-driven), Power Automate flows, and Power BI reports tailored to business needs.",
      "Extend and customise Microsoft Dynamics 365 Customer Engagement (CE), including entities, workflows and integrations.",
      "Collaborate with business stakeholders to gather and refine requirements through workshops and discussions.",
      "Translate business needs into functional and technical designs, ensuring clarity between development and business teams.",
      "Deliver user training, documentation and support to promote solution adoption and self-service.",
      "Engage with non-technical stakeholders to explain features, limitations and benefits of proposed solutions.",
      "Troubleshoot, optimise and enhance existing Power Platform and Dynamics CE applications.",
      "Keep up to date with new features, best practices and Microsoft updates across Power Platform and D365 CE."
    ],
    "workSettings": "remote",
    "roleCategory": "developer",
    "qualifications": [
      "Proven experience developing solutions with Microsoft Power Platform: Power Apps, Power Automate, and Power BI.",
      "Strong hands-on experience with Dynamics 365 Customer Engagement (CE), including configuration and customisation.",
      "Ability to engage with and present to stakeholders, both technical and non-technical.",
      "Comfortable leading workshops, gathering requirements, and explaining solutions in plain language.",
      "Good understanding of Dataverse, SharePoint, and the broader Microsoft 365 ecosystem.",
      "Strong documentation skills - including process maps, technical specs, and training guides.",
      "Excellent communication, interpersonal, and collaboration skills.",
      "Self-motivated, proactive, and confident working independently in a remote-first setup."
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 0.0,
    "maxSalary": 55000.0,
    "postedDate": "2025-08-20T03:49:11.645794",
    "category": "developer",
    "updatedAt": "2025-08-20T03:49:11.645794"
  },
  {
    "jobId": "nigel_frank_international_a0MP9000009GwE9.1_1754642890",
    "title": "Power Pages Developer (Power Platform)",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MP9000009GwE9.1_1754642890/power-pages-developer-power-platform",
    "description": "This is a great opportunity to join a global leading consultancy. They are growing out their software engineering practice and seeking skilled developers with a deep understanding of the Power Platform (especially Power Pages) to help develop solutions for their wide range of customers. As a Power Pages specialist, you will contribute to the build, implementation, testing and maintenance of Power Pages, as well as building and integrating with the wider Power Platform. Using a cross spectrum of technical skills, you will be able to build applications, advise on solutions and drive adoption of Power Pages / Power Platform.",
    "location": "England",
    "country": "United Kingdom",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "£50,000 to £70,000 GBP",
    "skills": [
      "Power Platform Developer",
      "Power Pages",
      "Power Apps",
      "Dataverse",
      "Dynamics",
      "Azure",
      "Power Automate"
    ],
    "experienceLevel": "intermediate",
    "currency": "GBP",
    "benefits": [
      "Grow within a leading global consultancy, with opportunities for personal and professional development.",
      "Work with a team of experts who are committed to excellence and innovation.",
      "Opportunities to attend Microsoft industry events",
      "25 days annual leave + public holidays with option to purchase additional days",
      "Competitive pension scheme",
      "Bonuses"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Lead the design, development and implementation of Power Pages solutions to meet user needs within a delivery team.",
      "Be a technical specialist, producing high quality applications, both model driven and canvas, as well as enterprise scale Power Automate Cloud Flow solutions.",
      "Understand governance principles and be able to advise on best practices for empowering every Power Platform maker.",
      "Build solutions as part of an agile team using declarative tools, backed by Microsoft and using our own technical accelerators.",
      "Help shape the Microsoft Business Applications technical capability by bringing your ideas for improvement forward and see them implemented."
    ],
    "workSettings": "",
    "roleCategory": "developer",
    "qualifications": [
      "Good understanding of the configuration of Power Pages",
      "An understanding of security best practices around Power Pages, with knowledge of items such as OWASP",
      "Hands on experience with Dataverse and Dataverse for Teams as part of implementing Power Platform solutions.",
      "Hands on experience in the setup of Continuous Integration (CI) and Continuous Delivery (CD), ideally using Azure DevOps.",
      "A passion for and experience with industry-wide standards and best practices when designing and building solutions in the Power Platform."
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 50000.0,
    "maxSalary": 70000.0,
    "postedDate": "2025-08-20T03:50:09.803547",
    "category": "developer",
    "updatedAt": "2025-08-20T03:50:09.803547"
  },
  {
    "jobId": "nigel_frank_international_a0MaA0000010cO5.2_1753362119",
    "title": "Analista Desarrollador MS Dynamics Business Central",
    "applicationUrl": "mailto:p.potier@tenthrevolution.com",
    "description": "Analista Programador/a MS Dynamics 365 Business Central. Trabajo 100% remoto | Residencia en España. ¿Tienes experiencia en Microsoft Dynamics NAV / Business Central y buscas un proyecto estable, en crecimiento y con excelentes condiciones? Te presentamos una oportunidad dentro de un grupo sólido, con una fuerte apuesta por el ecosistema Microsoft Dynamics 365 y Power Platform, donde el desarrollo profesional, la estabilidad y el bienestar del equipo son una prioridad. ¿Qué ofrecemos? Contrato indefinido desde el primer día. Salario competitivo. Seguro médico privado + retribución flexible (cheques restaurante, guardería, etc.). Plan de carrera claro y acompañamiento real al desarrollo profesional. 100% remoto (se valora residencia en España para visitas puntuales a cliente). Horario flexible, con jornada intensiva los viernes y en verano. Proceso de selección ágil: máximo dos entrevistas. Tu rol: Te incorporarás a un equipo técnico senior, participando en proyectos de alto nivel vinculados al ecosistema Microsoft. Tendrás la posibilidad de aportar ideas, crecer profesionalmente y trabajar en un entorno que prioriza la calidad técnica y el equilibrio personal.",
    "location": "Spain",
    "country": "Spain",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "",
    "skills": [
      "Dynamics 365 Business Central",
      "navision",
      "erp",
      "microsoft",
      "power platform"
    ],
    "experienceLevel": "expert",
    "currency": "",
    "benefits": [
      "Contrato indefinido desde el primer día",
      "Salario competitivo",
      "Seguro médico privado",
      "Retribución flexible (cheques restaurante, guardería, etc.)",
      "Plan de carrera claro y acompañamiento real al desarrollo profesional",
      "100% remoto",
      "Horario flexible, con jornada intensiva los viernes y en verano",
      "Proceso de selección ágil: máximo dos entrevistas"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Incorporarse a un equipo técnico senior",
      "Participar en proyectos de alto nivel vinculados al ecosistema Microsoft",
      "Aportar ideas",
      "Crecer profesionalmente",
      "Trabajar en un entorno que prioriza la calidad técnica y el equilibrio personal"
    ],
    "workSettings": "remote",
    "roleCategory": "developer",
    "qualifications": [
      "Experiencia en MS Dynamics NAV / 365 Business Central",
      "Perfil técnico con capacidad analítica",
      "Ganas de aportar valor y trabajar en equipo",
      "Residencia en España (preferente) o disponibilidad para visitas puntuales"
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 0.0,
    "maxSalary": 0.0,
    "postedDate": "2025-08-20T03:50:37.374878",
    "category": "developer",
    "updatedAt": "2025-08-20T03:50:37.374878"
  },
  {
    "jobId": "nigel_frank_international_a0MaA0000008K3B.30_1748362867",
    "title": "Head of Dynamics",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA0000008K3B.30_1748362867/head-of-dynamics",
    "description": "Head of Dynamics Bristol/Somerset (Hybrid) Looking to speak with Heads of Dynamics/Business Systems about an excellent new opportunity. The successful applicant will be responsible for managing the key business systems, leading projects and ensuring that our client's customers are getting the maximum out of their solutions.",
    "location": "Bristol, Somerset",
    "country": "England",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "£85,000 to £95,000 GBP",
    "skills": [
      "Dynamics 365 CE",
      "Power Platform",
      "Solution Architecture",
      "Technical Consulting",
      "Functional Consulting",
      "Pre-Sales",
      "Power Apps",
      "Power Automate",
      "Sales",
      "Marketing",
      "Customer Service"
    ],
    "experienceLevel": "expert",
    "currency": "GBP",
    "benefits": [
      "Flexible, Hybrid working model",
      "Life Assurance",
      "Enhanced pension contributions"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Manage teams across full project life-cycle including D365 & Power Platform Solution Architects & Technical/Functional Consultants.",
      "Explain benefits and possibilities of Power Platform to internal teams making sure that teams utilise low code capabilities to drive excellence.",
      "Oversee and take leadership of design, development and implementation of business applications.",
      "Enhance the reputation of company by representing our clients technical capabilities around the wider Microsoft Stack."
    ],
    "workSettings": "hybrid",
    "roleCategory": "leadership",
    "qualifications": [
      "Hands-On Experience with Dynamics Partner/Consultancy working in Solution Architect or more senior role.",
      "Track record leading delivery for D365 CE & Power Platform (Sales, Marketing & Customer Service, Power Apps, Power Automate) etc.",
      "Confident with Pre-Sales, leading discovery, technical demos etc.",
      "Ability to influence senior leadership internally and external stakeholders advising on best solutions etc."
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 85000.0,
    "maxSalary": 95000.0,
    "postedDate": "2025-08-20T03:51:11.411430",
    "category": "consultant",
    "updatedAt": "2025-08-20T03:51:11.411430"
  },
  {
    "jobId": "salocin_group_a0MaA000000MF6r.1_1748424662",
    "title": "Head of Business Applications (D365 / Power Platform)",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA000000MF6r.1_1748424662/head-of-business-applications-d365---power-platform",
    "description": "Job Title: Head of Business Applications (D365 / Power Platform)\nLocation: Bath (Hybrid role)\nSalary: £85 - £95k DOE\nAbout the company: The company are a leading Microsoft Partner at the forefront of Data & AI innovation. They deliver transformative solutions that empower organisations to operate smarter and more efficiently. They are now looking for a visionary Head of Business Applications to lead their talented D365 & Power Platform to help shape the future of their application services.",
    "location": "Bath",
    "country": "England",
    "state": "",
    "city": "Bath",
    "jobType": "fullTime",
    "salary": "£85,000 to £95,000 GBP",
    "skills": [
      "Head of Business Applications",
      "Head of Power Platform",
      "Dynamics 365",
      "Power Platform Lead",
      "Dynamics 365 Consultant",
      "Power Apps",
      "Copilot",
      "Data",
      "AI"
    ],
    "experienceLevel": "experienced",
    "currency": "GBP",
    "benefits": [
      "Autonomy to shape the direction of the Power Platform practice",
      "Competitive salary and benefits package"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Lead and line manage a team of Dynamics 365 & Power Platform Solution Architects, Functional Consultants, and Technical Consultants.",
      "Recruit and oversee bench resources (UK, nearshore, offshore) to meet peaks in demand.",
      "Champion Power Platform internally, promoting low-code/no-code capabilities to drive operational excellence.",
      "Drive adoption of AI solutions (especially Copilot) to automate manual tasks and focus on high-value work.",
      "Represent Salocin Group's technical capabilities to Microsoft, enhancing our partner reputation.",
      "Collaborate with clients to understand business goals and translate them into technical solutions.",
      "Oversee and lead the design, development, and implementation of application-based solutions.",
      "Support the Data, AI & Technology Consulting team as Lead Solution Architect, bridging high-level blueprints with detailed solution design."
    ],
    "workSettings": "hybrid",
    "roleCategory": "practiceLead",
    "qualifications": [
      "Proven experience managing Dynamics 365 & Power Platform teams.",
      "Deep understanding of Power Platform's low-code/no-code potential.",
      "Experience managing flexible resource pools across geographies.",
      "Familiarity with AI tools like Copilot and their business applications.",
      "Strong client engagement and solution design skills.",
      "Excellent leadership, communication, and project management abilities."
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 85000.0,
    "maxSalary": 95000.0,
    "postedDate": "2025-08-20T03:51:40.256230",
    "category": "consultant",
    "updatedAt": "2025-08-20T03:51:40.256230"
  },
  {
    "jobId": "nigel_frank_international_a0MP9000009G0uv.1_1753173444",
    "title": "Power Platform & Azure Data Developer (AI focused)",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MP9000009G0uv.1_1753173444/power-platform-amp-azure-data-developer-ai-focused",
    "description": "This is a great opportunity to join a Pharmaceutical company in London who are growing their team. The business are in the process of delivering some of their AI strategies and are seeking a dynamic and skilled Power Platform & Azure Data Developer with hands-on experience or exposure to AI.",
    "location": "London",
    "country": "United Kingdom",
    "state": "",
    "city": "London",
    "jobType": "fullTime",
    "salary": "£60,000 to £70,000 GBP",
    "skills": [
      "Power Platform",
      "Power Apps",
      "Power Automate",
      "Power BI",
      "Azure Data Factory",
      "Azure OpenAI",
      "Azure Machine Learning",
      "SharePoint",
      "Dynamics",
      "AI/ML"
    ],
    "experienceLevel": "intermediate",
    "currency": "GBP",
    "benefits": [],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Design, build, and maintain Power Apps (integrate them with Power Automate and in Power BI).",
      "Integrate Power Platform solutions with other Microsoft services (e.g SharePoint, Dynamics).",
      "Build and manage data pipelines using Azure Data Factory.",
      "Support the deployment of cognitive services (e.g., Azure OpenAI, Azure Machine Learning).",
      "Work closely with business stakeholders, analysts, and other developers to gather requirements.",
      "Proven experience designing and deploying Power Automate workflows.",
      "AI/ML exposure with basic understanding of AI concepts."
    ],
    "workSettings": "hybrid",
    "roleCategory": "developer",
    "qualifications": [],
    "companyLogo": "",
    "companyName": "Nigel Frank International",
    "minSalary": 60000.0,
    "maxSalary": 70000.0,
    "postedDate": "2025-08-20T03:52:27.673535",
    "category": "developer",
    "updatedAt": "2025-08-20T03:52:27.673535"
  },
  {
    "jobId": "nigel_frank_international_a0MaA000000HVvR.5_1750262973",
    "title": "Systems/ Process Analyst",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA000000HVvR.5_1750262973/systems--process-analyst",
    "description": "Business Systems Analyst Manchester | End User | Permanent | £40,000-£50,000 + Benefits\nAre you a Business Systems Analyst with a passion for making a difference?\nWe're working with a well-established end user based in Manchester that's investing heavily in digital transformation. They're looking to bring on board a Business Systems Analyst to help shape and deliver innovative solutions across their Microsoft ecosystem.\nThe Role\nAs a key member of the internal IT and transformation team, you'll be responsible for:\n* Gathering and analysing business requirements to design and deliver Power Platform solutions.\n* Collaborating with stakeholders across departments to translate needs into technical specifications.\n* Driving automation and data visibility through Power Automate and Power BI.\n* Supporting the full solution lifecycle from concept through to deployment and optimisation.\nWhat You'll Need\n* Proven experience in a Business Analyst or Systems Analyst role.\n* Strong hands-on experience with Power Platform (Power Apps, Power Automate, Power BI).\n* Knowledge of Microsoft Dynamics\n* Excellent communication and stakeholder management skills.\n* Agile delivery experience is a plus.\nWhat's on Offer\n* A collaborative, forward-thinking environment with real ownership of your work.\n* 5 days a week onsite in their modern central Manchester offices\n* Career development opportunities and support for Microsoft certifications.\n* Competitive salary and benefits package.",
    "location": "Manchester",
    "country": "United Kingdom",
    "state": "England",
    "city": "Manchester",
    "jobType": "fullTime",
    "salary": "£40,000 to £50,000 GBP",
    "skills": [
      "Power Platform",
      "Power Apps",
      "Power Automate",
      "Power BI",
      "Microsoft Dynamics",
      "Business Analysis",
      "Stakeholder Management",
      "Agile"
    ],
    "experienceLevel": "intermediate",
    "currency": "GBP",
    "benefits": [
      "Collaborative, forward-thinking environment",
      "Real ownership of your work",
      "5 days a week onsite in modern central Manchester offices",
      "Career development opportunities",
      "Support for Microsoft certifications",
      "Competitive salary and benefits package"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Gathering and analysing business requirements to design and deliver Power Platform solutions",
      "Collaborating with stakeholders across departments to translate needs into technical specifications",
      "Driving automation and data visibility through Power Automate and Power BI",
      "Supporting the full solution lifecycle from concept through to deployment and optimisation"
    ],
    "workSettings": "onSite",
    "roleCategory": "business analyst",
    "qualifications": [
      "Proven experience in a Business Analyst or Systems Analyst role",
      "Strong hands-on experience with Power Platform (Power Apps, Power Automate, Power BI)",
      "Knowledge of Microsoft Dynamics",
      "Excellent communication and stakeholder management skills",
      "Agile delivery experience is a plus"
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank International",
    "minSalary": 40000.0,
    "maxSalary": 50000.0,
    "postedDate": "2025-08-20T03:52:56.509270",
    "category": "analytics",
    "updatedAt": "2025-08-20T03:52:56.509270"
  },
  {
    "jobId": "nigel_frank_international_a0MP9000009GMQn.1_1753952304",
    "title": "Power Platform Architect",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MP9000009GMQn.1_1753952304/power-platform-architect",
    "description": "This is a great opportunity to join a specialist Power Platform consultancy who are growing their teams across Data, AI and Power Platform. As a Power Platform Architect, you will play a pivotal role in designing and implementing cutting-edge solutions that leverage the full capabilities of the Power Platform. This will include leading pre-sales engagements and architecture for some of their customers. As a business they are active in the Power Platform community and there will be opportunities to attend industry events, and work alongside a team of Microsoft MVP's.",
    "location": "London",
    "country": "United Kingdom",
    "state": "",
    "city": "London",
    "jobType": "fullTime",
    "salary": "Up to £90,000 DOE",
    "skills": [
      "Power Platform",
      "Power Platform Architect",
      "Power Apps",
      "Model Driven",
      "Canvas Apps",
      "Dataverse",
      "Pre sales",
      "Solution Architect"
    ],
    "experienceLevel": "experienced",
    "currency": "GBP",
    "benefits": [],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Lead the design, development, and implementation of Power Platform solutions to meet diverse client needs.",
      "Collaborate with stakeholders to understand requirements and translate them into technical solutions.",
      "Utilise your expertise in model-driven and canvas apps, as well as enterprise-scale Power Automate Cloud Flow solutions.",
      "Advise on best practices for governance and empower Power Platform makers.",
      "Integrate solutions with the wider Microsoft stack, including Azure and Dynamics 365.",
      "Drive adoption of DevOps practices within the Power Platform ecosystem."
    ],
    "workSettings": "hybrid",
    "roleCategory": "architect",
    "qualifications": [
      "Extensive knowledge of the Power Platform, including its technologies, capabilities, and limitations.",
      "Hands-on experience with Dataverse and Dataverse for Teams.",
      "Proven track record in setting up Continuous Integration (CI) and Continuous Delivery (CD) using Azure DevOps.",
      "Strong understanding of industry-wide standards and best practices for designing and building Power Platform solutions.",
      "Leading pre-sales engagements with customers, promoting the benefits of the Power Platform.",
      "Experience working in agile teams and delivering solutions in a commercial environment."
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank International",
    "minSalary": 0.0,
    "maxSalary": 90000.0,
    "postedDate": "2025-08-20T03:53:22.035482",
    "category": "architect",
    "updatedAt": "2025-08-20T03:53:22.035482"
  },
  {
    "jobId": "nigel_frank_international_a0MaA0000010r8b.1_1752244328",
    "title": "Consultant Power Platform",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA0000010r8b.1_1752244328/consultant-power-platform",
    "description": "Vos principales missions : Développer et maintenir des applications Power Apps à destination des équipes métier (back-office, supply, retail). Automatiser les processus internes à l'aide de Power Automate en lien avec D365 F&O. Assurer le support technique, la documentation, et contribuer à l'amélioration continue des outils Power Platform. Environnement : Microsoft Power Platform (Power Apps, Power Automate, Dataverse). Intégration avec D365 F&O.",
    "location": "France",
    "country": "France",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "€45,000 to €50,000 EUR",
    "skills": [
      "Power Platform",
      "Power Apps",
      "Power Automate",
      "Dataverse",
      "D365 F&O"
    ],
    "experienceLevel": "beginner",
    "currency": "EUR",
    "benefits": [],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Développer et maintenir des applications Power Apps à destination des équipes métier (back-office, supply, retail)",
      "Automatiser les processus internes à l'aide de Power Automate en lien avec D365 F&O",
      "Assurer le support technique, la documentation, et contribuer à l'amélioration continue des outils Power Platform"
    ],
    "workSettings": "",
    "roleCategory": "consultant",
    "qualifications": [],
    "companyLogo": "",
    "companyName": "Nigel Frank International",
    "minSalary": 45000.0,
    "maxSalary": 50000.0,
    "postedDate": "2025-08-20T03:53:44.892400",
    "category": "consultant",
    "updatedAt": "2025-08-20T03:53:44.892400"
  },
  {
    "jobId": "nigel_frank_9b9f9899c7",
    "title": "",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA000000BPBB.1_1749199238/power-platform-solution-architect",
    "description": "",
    "location": "",
    "country": "",
    "state": "",
    "city": "",
    "jobType": "",
    "salary": "",
    "skills": [],
    "experienceLevel": "",
    "currency": "",
    "benefits": [],
    "approvalStatus": "",
    "jobStatus": "",
    "responsibilities": [],
    "workSettings": "",
    "roleCategory": "",
    "qualifications": [],
    "companyLogo": "",
    "companyName": "Nigel Frank International",
    "minSalary": 0.0,
    "maxSalary": 0.0,
    "postedDate": "2025-08-20T03:53:53.078898",
    "category": "",
    "updatedAt": "2025-08-20T03:53:53.078898"
  },
  {
    "jobId": "nigel_frank_international_a0M0Y000006eSml.3_1753891392",
    "title": "Dynamics 365 CRM Professionals",
    "applicationUrl": "https://www.nigelfrank.com/job/a0M0Y000006eSml.3_1753891392/dynamics-365-crm-professionals",
    "description": "Job Opportunity: CRM & Microsoft Dynamics 365 Professionals\nLocation: South Africa (Remote or Hybrid - Johannesburg, Cape Town, Durban)\nType: Full-time | Contract or Permanent\nSalary: Market-related with benefits and potential bonuses\nWe're currently partnering with several leading companies across South Africa and internationally who are expanding their CRM and Microsoft Dynamics 365 teams. As a specialist tech recruitment agency, we're looking to connect with skilled professionals who have hands-on experience with Dynamics 365 and are ready for a new challenge.\nWhat we're hiring for: We're working on multiple roles across different industries - from consulting and professional services to retail, and enterprise environments. Current openings include:\n- Dynamics 365 CRM Consultants (Functional and Technical)\n- CRM Developers\n- Solution Architects\n- Business Analysts\n- CRM Project Managers\nKey experience we're looking for:\n- Proven experience with Microsoft Dynamics 365 CE / CRM (Sales, Marketing, Customer Service, Field Service)\n- Solid understanding of CRM processes, design, and implementation\n- Familiarity with the Power Platform (Power Apps, Power Automate, Power BI)\n- Strong integration experience\n- Ability to translate business requirements into technical solutions\n- Relevant certifications (e.g., MB-210, PL-200, PL-600) are an advantage\nWhy work with us? As tech recruiters focused on the Dynamics and CRM space, we work closely with both niche start-ups and large enterprise organisations. This means we can offer:\n- Access to roles that aren't always advertised publicly\n- A streamlined recruitment process with honest feedback and guidance\n- Support from recruiters who understand the Microsoft tech ecosystem\n- Remote and hybrid working opportunities depending on the client\nRequirements:\n- 5+ year's experience in Dynamics 365 CRM or related technologies\n- Excellent communication and stakeholder engagement skills\n- Based in South Africa with the right to work locally\n- A proactive, solution-oriented approach",
    "location": "South Africa",
    "country": "South Africa",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "",
    "skills": [
      "CRM",
      "MS Dynamics - CRM",
      "MS Dynamics - GP (Great Plains)",
      "Microsoft Dynamics 365 CE",
      "Sales",
      "Marketing",
      "Customer Service",
      "Field Service",
      "CRM processes",
      "Power Platform",
      "Power Apps",
      "Power Automate",
      "Power BI",
      "Integration",
      "Business requirements analysis"
    ],
    "experienceLevel": "experienced",
    "currency": "",
    "benefits": [
      "Market-related salary",
      "Benefits",
      "Potential bonuses",
      "Access to unadvertised roles",
      "Streamlined recruitment process",
      "Honest feedback and guidance",
      "Support from Microsoft tech recruiters",
      "Remote and hybrid working opportunities"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Work as Dynamics 365 CRM Consultant, Developer, Solution Architect, Business Analyst, or Project Manager",
      "Design and implement CRM processes",
      "Integrate Dynamics 365 with other systems",
      "Translate business requirements into technical solutions",
      "Engage with stakeholders",
      "Participate in consulting, professional services, retail, or enterprise projects"
    ],
    "workSettings": "remote",
    "roleCategory": "consultant",
    "qualifications": [
      "5+ years experience in Dynamics 365 CRM or related technologies",
      "Excellent communication and stakeholder engagement skills",
      "Based in South Africa with the right to work locally",
      "Relevant certifications (e.g., MB-210, PL-200, PL-600) are an advantage",
      "Proactive, solution-oriented approach"
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 0.0,
    "maxSalary": 0.0,
    "postedDate": "2025-08-20T03:54:42.698216",
    "category": "consultant",
    "updatedAt": "2025-08-20T03:54:42.698216"
  },
  {
    "jobId": "nigel_frank_international_a0GaA000000taxJ.2_1754473183",
    "title": "Dynamics Business Central - Developer",
    "applicationUrl": "https://www.nigelfrank.com/job/a0GaA000000taxJ.2_1754473183/dynamics-business-central-developer",
    "description": "Senior Dynamics 365 Business Central Developer\nUp to £70k + Benefits | Remote or Hybrid | UK-Based\nMy client is a fast-growing Microsoft Partner looking to bring on board a Senior Business Central Developer to play a key role in delivering high-quality customisations and technical solutions across a range of BC projects. You'll work closely with functional consultants and the wider technical team to build scalable, reliable and high-performing solutions for clients across multiple industries.",
    "location": "England",
    "country": "United Kingdom",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "£70,000 to £75,000 GBP",
    "skills": [
      "Dynamics 365 Business Central",
      "Dynamics NAV",
      "AL",
      "C/AL",
      "API integrations",
      "web services",
      "extensions",
      "technical support",
      "troubleshooting",
      "performance optimization",
      "code quality",
      "testing",
      "peer reviews"
    ],
    "experienceLevel": "expert",
    "currency": "GBP",
    "benefits": [
      "25 days holiday plus bank holidays",
      "Flexible working - fully remote or hybrid",
      "Clear progression pathway into Lead Developer or Technical Architect roles",
      "Supportive team culture with regular knowledge sharing and development opportunities",
      "Comprehensive benefits package"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Design, develop and implement custom solutions within Dynamics 365 Business Central (AL and C/AL)",
      "Lead the technical development of end-to-end BC implementation and upgrade projects",
      "Build and maintain extensions, integrations and custom modules to meet client-specific needs",
      "Collaborate with functional consultants to translate requirements into robust technical specifications",
      "Upgrade legacy NAV systems to Business Central, ensuring minimal disruption and improved functionality",
      "Optimise performance and ensure code quality through testing, peer reviews and best practice development",
      "Provide technical support and troubleshooting for deployed solutions post go-live",
      "Keep up to date with the latest BC features, tools and development practices",
      "Mentor junior developers and contribute to internal development standards"
    ],
    "workSettings": "remote",
    "roleCategory": "developer",
    "qualifications": [
      "Strong hands-on development experience with Dynamics NAV and Business Central (AL and C/AL)",
      "Proven experience working in a Microsoft Partner or consultancy environment",
      "Solid understanding of Business Central architecture and best practice coding standards",
      "Experience with API integrations, web services and extensions",
      "Strong problem-solving skills and attention to detail",
      "Excellent communication skills and ability to work collaboratively with cross-functional teams"
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 70000.0,
    "maxSalary": 75000.0,
    "postedDate": "2025-08-20T03:55:15.538997",
    "category": "developer",
    "updatedAt": "2025-08-20T03:55:15.538997"
  },
  {
    "jobId": "nigel_frank_a0MP9000009HHdZ.3_1755048372",
    "title": "Lead Dynamics 365 Business Central Consultant - Remote",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MP9000009HHdZ.3_1755048372/lead-dynamics-365-business-central-consultant-remote",
    "description": "Join a dynamic team dedicated to delivering exceptional solutions. We are seeking a Microsoft Dynamics 365 Business Central Functional Consultant to join our client's team. This is a permanent role based in the USA, offering the opportunity to work remotely with approximately 25% travel. The ideal candidate will play a vital role in enhancing business processes and implementing innovative solutions using Dynamics 365 Business Central for varied clients.",
    "location": "United States",
    "country": "United States",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "US$135,000 to US$150,000 USD",
    "skills": [
      "Dynamics 365 Business Central",
      "project management",
      "EDI",
      "Budget management",
      "team management",
      "Azure",
      "ISV",
      "Implementation"
    ],
    "experienceLevel": "expert",
    "currency": "USD",
    "benefits": [
      "Generous Base Salary",
      "Bonus Plan",
      "Health Insurance",
      "Dental/Vision Insurance",
      "401K Match",
      "Vacation/Holidays/Sabbatical",
      "FSA"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Collaborate with stakeholders to gather requirements and translate them into Business Central functionality",
      "Provide expert insight into Dynamics 365 Business Central best practices to drive project success.",
      "Support system integrations and customizations to optimize workflow efficiency.",
      "Train and assist end-users on system functionalities, ensuring smooth adoption.",
      "Stay updated on Dynamics 365 Business Central developments to drive continuous improvement.",
      "Configure, map, and test EDI transactions (X12, EDIFACT, XML, etc.) for smooth data flow"
    ],
    "workSettings": "remote",
    "roleCategory": "functional consultant",
    "qualifications": [],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 135000.0,
    "maxSalary": 150000.0,
    "postedDate": "2025-08-20T03:55:38.797248",
    "category": "consultant",
    "updatedAt": "2025-08-20T03:55:38.797248"
  },
  {
    "jobId": "nigel_frank_international_a0MaA000000YAEg.1_1752074130",
    "title": "Power Platform & Dynamics CRM Developer",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA000000YAEg.1_1752074130/power-platform-amp-dynamics-crm-developer",
    "description": "We are looking for a skilled Power Platform & Dynamics CRM Developer to build and maintain custom solutions using Microsoft Power Platform and Dynamics 365. You'll work closely with business teams to design, develop, and implement business process automation, custom apps, and data solutions.",
    "location": "Malmo, Sweden",
    "country": "Sweden",
    "state": "",
    "city": "Malmo",
    "jobType": "fullTime",
    "salary": "60,000 to 65,000 SEK",
    "skills": [
      "Power Apps",
      "Power Automate",
      "Power BI",
      "Dynamics 365 CRM",
      "Dynamics 365 for Sales",
      "JavaScript",
      "C#",
      "web technologies",
      "Power Platform connectors",
      "data integration"
    ],
    "experienceLevel": "intermediate",
    "currency": "SEK",
    "benefits": [],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Develop solutions using Power Apps, Power Automate, Power BI, and Dynamics 365 CRM.",
      "Customize and extend Dynamics CRM functionality (Sales, Customer Service).",
      "Automate workflows and business processes with Power Automate.",
      "Collaborate with stakeholders to define requirements and deliver solutions.",
      "Troubleshoot, test, and maintain applications.",
      "Create reports and dashboards in Power BI.",
      "Stay current on Microsoft technologies and industry trends."
    ],
    "workSettings": "",
    "roleCategory": "developer",
    "qualifications": [
      "Experience with Power Platform (Power Apps, Power Automate, Power BI) and Dynamics 365 CRM.",
      "Strong knowledge of Dynamics CRM customization, Power Platform connectors, and data integration.",
      "Proficient in JavaScript, C#, and web technologies.",
      "Ability to work with cross-functional teams and gather requirements.",
      "Microsoft certifications in Power Platform/Dynamics 365 (preferred)."
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 60000.0,
    "maxSalary": 65000.0,
    "postedDate": "2025-08-20T03:56:03.098434",
    "category": "developer",
    "updatedAt": "2025-08-20T03:56:03.098434"
  },
  {
    "jobId": "nigel_frank_international_a0MaA000000toIj.1_1749157227",
    "title": "Dynamics 365 CE Solutions Architect",
    "applicationUrl": "mailto:m.ramirez@nigelfrank.com",
    "description": "My client is seeking a highly skilled and motivated Dynamics 365 CE Solutions Architect to join our growing team in Miami, Florida. This role is ideal for someone who thrives on designing and delivering innovative CRM solutions that empower field teams and streamline operations.",
    "location": "Miami, Florida, United States",
    "country": "United States",
    "state": "Florida",
    "city": "Miami",
    "jobType": "fullTime",
    "salary": "140000 - 145000 USD per year",
    "skills": [
      "Dynamics 365 Customer Engagement",
      "Field Service module",
      "Power Platform",
      "Power Apps",
      "Power Automate",
      "Power Pages",
      "RESTful APIs",
      "HTML",
      "JavaScript",
      "MS Dynamics - CRM"
    ],
    "experienceLevel": "expert",
    "currency": "USD",
    "benefits": [
      "Competitive salary and benefits package",
      "Flexible work environment",
      "Opportunity to work on cutting-edge Microsoft technologies",
      "Collaborative and innovative team culture"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Architect and implement end-to-end solutions using Dynamics 365 Customer Engagement, with a focus on the Field Service module",
      "Design and develop custom applications using the Power Platform (Power Apps, Power Automate, Power Pages)",
      "Integrate D365 CE with external systems via APIs, and build responsive, user-friendly interfaces using HTML and JavaScript",
      "Collaborate with stakeholders to gather requirements, define architecture, and ensure successful project delivery",
      "Provide technical leadership and mentorship to development teams"
    ],
    "workSettings": "hybrid",
    "roleCategory": "solutions architect",
    "qualifications": [
      "Experience with Dynamics 365 CE, including hands-on work with the Field Service module",
      "Strong proficiency in Power Platform tools: Power Apps, Power Automate, and Power Pages",
      "Experience connecting to and consuming RESTful APIs",
      "Solid front-end development skills with HTML and JavaScript",
      "Excellent communication and problem-solving skills",
      "Microsoft certifications in Dynamics 365 and/or Power Platform (preferred)",
      "Experience in agile project environments (preferred)",
      "Familiarity with Azure services and DevOps practices (preferred)"
    ],
    "companyLogo": "",
    "companyName": "Nigel Frank",
    "minSalary": 140000.0,
    "maxSalary": 145000.0,
    "postedDate": "2025-08-20T03:56:28.178434",
    "category": "architect",
    "updatedAt": "2025-08-20T03:56:28.178434"
  },
  {
    "jobId": "nigel_frank_international_a0MaA0000008K3B.30_1748362867",
    "title": "Head of Dynamics",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA0000008K3B.30_1748362867/head-of-dynamics",
    "description": "Head of Dynamics Bristol/Somerset (Hybrid) Looking to speak with Heads of Dynamics/Business Systems about an excellent new opportunity. The successful applicant will be responsible for managing the key business systems, leading projects and ensuring that our client's customers are getting the maximum out of their solutions.",
    "location": "Bristol, Somerset",
    "country": "England",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "£85,000 to £95,000 GBP",
    "skills": [
      "Dynamics 365 CE",
      "Power Platform",
      "Solution Architecture",
      "Technical Consulting",
      "Functional Consulting",
      "Pre-Sales",
      "Power Apps",
      "Power Automate",
      "Sales",
      "Marketing",
      "Customer Service"
    ],
    "experienceLevel": "expert",
    "currency": "GBP",
    "benefits": [
      "Flexible, Hybrid working model",
      "Life Assurance",
      "Enhanced pension contributions"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Manage teams across full project life-cycle including D365 & Power Platform Solution Architects & Technical/Functional Consultants.",
      "Explain benefits and possibilities of Power Platform to internal teams making sure that teams utilise low code capabilities to drive excellence.",
      "Oversee and take leadership of design, development and implementation of business applications.",
      "Enhance the reputation of company by representing our clients technical capabilities around the wider Microsoft Stack."
    ],
    "workSettings": "hybrid",
    "roleCategory": "management",
    "qualifications": [
      "Hands-On Experience with Dynamics Partner/Consultancy working in Solution Architect or more senior role.",
      "Track record leading delivery for D365 CE & Power Platform (Sales, Marketing & Customer Service, Power Apps, Power Automate) etc.",
      "Confident with Pre-Sales, leading discovery, technical demos etc.",
      "Ability to influence senior leadership internally and external stakeholders advising on best solutions etc."
    ],
    "companyLogo": "",
    "companyName": "",
    "minSalary": 85000.0,
    "maxSalary": 95000.0,
    "postedDate": "2025-08-20T03:56:41.975592",
    "category": "consultant",
    "updatedAt": "2025-08-20T03:56:41.975592"
  },
  {
    "jobId": "nigel_frank_international_a0MaA000000UspN.3_1749133234",
    "title": "Senior Dynamics Developer",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA000000UspN.3_1749133234/senior-dynamics-developer",
    "description": "Currently seeking a D365 CE Developer, with experience working on D365 CE - Sales & Marketing, to join a forward-thinking team at a well-established end user! This position offers the successful candidate the opportunity to take on a leading role in designing and developing Dynamics 365 CE enhancements, working closely with a like-minded team and applying their technical skills to have a significant impact on their D365 CE/CRM projects. My client offers a flexible, hybrid working model (2 days a week - Coventry) with an excellent starting salary and benefits.",
    "location": "England",
    "country": "United Kingdom",
    "state": "",
    "city": "Coventry",
    "jobType": "fullTime",
    "salary": "£60,000 to £72,500 GBP",
    "skills": [
      "Microsoft Dynamics 365 CRM",
      "customisations",
      "configurations",
      "C#",
      ".NET",
      "JavaScript",
      "plugin development",
      "automating business processes",
      "D365"
    ],
    "experienceLevel": "experienced",
    "currency": "GBP",
    "benefits": [
      "flexible, hybrid working model",
      "excellent starting salary",
      "benefits"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Working on varied projects to develop and implement Dynamics 365 CE",
      "Engage with stakeholders to gain a more detailed understanding of the requirements, where required.",
      "Bringing fresh ideas for improvements and influencing how they are implemented.",
      "Create and build solutions as part of an agile team, ensuring a collaborative approach to achieve exceptional results."
    ],
    "workSettings": "hybrid",
    "roleCategory": "developer",
    "qualifications": [
      "Strong experience with Microsoft Dynamics 365 CRM, including customisations and configurations.",
      "Proficiency in C#, .NET, and JavaScript for plugin development and extending the platform.",
      "Proven track record in automating business processes within D365.",
      "Excellent problem-solving skills and the ability to collaborate effectively with colleagues and end users.",
      "Understanding of the full software development life-cycle, with a keen eye for detail and quality"
    ],
    "companyLogo": "",
    "companyName": "",
    "minSalary": 60000.0,
    "maxSalary": 72500.0,
    "postedDate": "2025-08-20T03:57:05.749727",
    "category": "developer",
    "updatedAt": "2025-08-20T03:57:05.749727"
  },
  {
    "jobId": "nigel_frank_international_a0MaA000000vDrl.1_1750666685",
    "title": "Dynamics FO Consultant",
    "applicationUrl": "https://www.nigelfrank.com/job/a0MaA000000vDrl.1_1750666685/dynamics-fo-consultant",
    "description": "Finance and Operations Consultant\nA multinational distributor is looking to hire an F&O Consultant to support its global roll out and improvement of Microsoft Dynamics 365 Finance & Operations (F&O). With the business employing thousands of members across the globe, prepare to join a large scale project with multinational impact.\n\nAbout the Role\nThis is an in house position suited for a skilled professional who enjoys problem solving, improving systems, and leading technical decisions. The role sits at the center of the company's ERP landscape, focusing on architecture and performance enhancements.",
    "location": "Belgium",
    "country": "Belgium",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "Up to €110,000 EUR",
    "skills": [
      "Microsoft Dynamics 365 Finance & Operations",
      "ERP architecture",
      "Azure",
      "System performance optimization",
      "Custom development",
      "Technical leadership",
      "Communication"
    ],
    "experienceLevel": "expert",
    "currency": "EUR",
    "benefits": [
      "A collaborative and multicultural work environment",
      "Flexibility through hybrid working and adjustable hours",
      "Exposure to international projects with room to grow",
      "An in house role offering variety, ownership, and long term stability",
      "A company culture that values input, initiative, and development",
      "Competitive salary and benefits package up to €110k"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Manage F&O environments and coordinate updates, builds, and releases",
      "Be the direct link between technical and functional experts",
      "Communicate with external partners",
      "Design and maintain the ERP system architecture with future growth in mind",
      "Lead and manage custom developments across third-party add-ons",
      "Turn business requirements into technical solutions",
      "Optimise system performance, scalability, and security"
    ],
    "workSettings": "hybrid",
    "roleCategory": "consultant",
    "qualifications": [
      "Experience working with F&O in a technical lead or architect role",
      "Strong understanding of ERP architecture",
      "Knowledge of Azure",
      "Confident communicator who works well with global teams",
      "Able to take initiative and work independently",
      "Fluent in English"
    ],
    "companyLogo": "",
    "companyName": "",
    "minSalary": 0.0,
    "maxSalary": 110000.0,
    "postedDate": "2025-08-20T03:57:51.373643",
    "category": "consultant",
    "updatedAt": "2025-08-20T03:57:51.373643"
  },
  {
    "jobId": "leading_microsoft_gold_partner_7525-29/06/23_1750424477",
    "title": "Dynamics 365 CE Developer",
    "applicationUrl": "https://www.nigelfrank.com/job/7525-29%2F06%2F23_1750424477/dynamics-365-ce-developer",
    "description": "Job Title: Dynamics CE/CRM Developer\nLocation: Gothenburg\nCompany: Leading Microsoft Gold Partner\nAre you a skilled Dynamics CRM Developer ready to deliver innovative CRM solutions that make an impact? Join a renowned Microsoft Gold Partner where you'll work with cutting-edge technologies, collaborate with top professionals, and contribute to transformative projects for high-profile clients.\nYour Role:\nAs a Dynamics CRM Developer, you will:\n- Develop and customize Microsoft Dynamics CRM solutions to meet client needs.\n- Collaborate with cross-functional teams to gather requirements and deliver scalable solutions.\n- Extend CRM functionality through custom code, plugins, workflows, and third-party integrations.\n- Conduct unit testing, debugging, and code reviews to ensure quality and performance.\n- Stay up-to-date with the latest Dynamics CRM features and provide innovative solutions.\n- Create and maintain technical documentation, including design documents and user manuals.\nWhat's in It for You?\nJoin a team that values innovation, growth, and work-life balance:\n- Competitive Salary: Attractive package with performance-based incentives.\n- Health & Wellness: Comprehensive health insurance and wellness programs.\n- Flexibility: Hybrid working model with flexible hours.\n- Growth Opportunities: Ongoing training, certifications, and professional development.\n- Team Culture: Collaborative environment with supportive colleagues and leaders.\n- Exciting Projects: Work on prestigious client engagements using the latest technologies.\n- Perks: Generous vacation, paid time off, social events, and employee recognition programs.\nWhy Join Us?\nAs a Microsoft Gold Partner, we're committed to excellence, innovation, and empowering our employees. You'll have the chance to advance your career while delivering impactful solutions that drive success for our clients.\nIf you're ready to take the next step in your career as a Dynamics CRM Developer, apply now and become part of a team where your skills and creativity make a difference!",
    "location": "Gothenburg, Sweden",
    "country": "Sweden",
    "state": "",
    "city": "Gothenburg",
    "jobType": "fullTime",
    "salary": "45,000 to 70,000 SEK",
    "skills": [
      "Dynamics CRM",
      "Customer engagement",
      "CRM",
      "CE",
      "D365CE",
      "D365 CRM",
      "Marketing",
      ".NET",
      "C#",
      "JavaScript",
      "SQL",
      "Visual Studio",
      "XRM Toolbox",
      "CRM SDK",
      "HTML",
      "CSS",
      "REST/SOAP web services",
      "data migration",
      "CRM integration"
    ],
    "experienceLevel": "intermediate",
    "currency": "SEK",
    "benefits": [
      "Attractive package with performance-based incentives",
      "Comprehensive health insurance and wellness programs",
      "Hybrid working model with flexible hours",
      "Ongoing training, certifications, and professional development",
      "Collaborative environment with supportive colleagues and leaders",
      "Generous vacation",
      "Paid time off",
      "Social events",
      "Employee recognition programs"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Develop and customize Microsoft Dynamics CRM solutions to meet client needs",
      "Collaborate with cross-functional teams to gather requirements and deliver scalable solutions",
      "Extend CRM functionality through custom code, plugins, workflows, and third-party integrations",
      "Conduct unit testing, debugging, and code reviews to ensure quality and performance",
      "Stay up-to-date with the latest Dynamics CRM features and provide innovative solutions",
      "Create and maintain technical documentation, including design documents and user manuals"
    ],
    "workSettings": "hybrid",
    "roleCategory": "developer",
    "qualifications": [
      "Fluency in Swedish (written and verbal) is essential",
      "Proven experience developing and customizing Microsoft Dynamics CRM solutions using .NET, C#, JavaScript, and SQL",
      "Strong understanding of CRM architecture, including entity relationships, workflows, forms, and security models",
      "Hands-on experience with tools like Visual Studio, XRM Toolbox, and the CRM SDK",
      "Familiarity with web technologies (HTML, CSS, REST/SOAP web services) and integration tools",
      "Knowledge of data migration and CRM integration techniques",
      "A degree in Computer Science or a related field (equivalent experience considered)",
      "Microsoft Dynamics CRM certifications (e.g., MB-210, MB-220, MB-230) are a plus",
      "Excellent problem-solving, collaboration, and communication skills"
    ],
    "companyLogo": "",
    "companyName": "Leading Microsoft Gold Partner",
    "minSalary": 45000.0,
    "maxSalary": 70000.0,
    "postedDate": "2025-08-20T03:58:27.257678",
    "category": "developer",
    "updatedAt": "2025-08-20T03:58:27.257678"
  },
  {
    "jobId": "nigel_frank_international_a0GaA000000taxJ.2_1750681617",
    "title": "Dynamics Business Central - Developer",
    "applicationUrl": "https://www.nigelfrank.com/job/a0GaA000000taxJ.2_1750681617/dynamics-business-central-developer",
    "description": "Senior Dynamics 365 Business Central Developer\nUp to £70k + Benefits | Remote or Hybrid | UK-Based\nMy client is a fast-growing Microsoft Partner looking to bring on board a Senior Business Central Developer to play a key role in delivering high-quality customisations and technical solutions across a range of BC projects. You'll work closely with functional consultants and the wider technical team to build scalable, reliable and high-performing solutions for clients across multiple industries.",
    "location": "England",
    "country": "United Kingdom",
    "state": "",
    "city": "",
    "jobType": "fullTime",
    "salary": "£70,000 to £75,000 GBP",
    "skills": [
      "Dynamics 365 Business Central",
      "Dynamics NAV",
      "AL",
      "C/AL",
      "API integrations",
      "web services",
      "extensions",
      "technical support",
      "troubleshooting"
    ],
    "experienceLevel": "expert",
    "currency": "GBP",
    "benefits": [
      "25 days holiday plus bank holidays",
      "Flexible working - fully remote or hybrid",
      "Clear progression pathway into Lead Developer or Technical Architect roles",
      "Supportive team culture with regular knowledge sharing and development opportunities",
      "Comprehensive benefits package"
    ],
    "approvalStatus": "",
    "jobStatus": "open",
    "responsibilities": [
      "Design, develop and implement custom solutions within Dynamics 365 Business Central (AL and C/AL)",
      "Lead the technical development of end-to-end BC implementation and upgrade projects",
      "Build and maintain extensions, integrations and custom modules to meet client-specific needs",
      "Collaborate with functional consultants to translate requirements into robust technical specifications",
      "Upgrade legacy NAV systems to Business Central, ensuring minimal disruption and improved functionality",
      "Optimise performance and ensure code quality through testing, peer reviews and best practice development",
      "Provide technical support and troubleshooting for deployed solutions post go-live",
      "Keep up to date with the latest BC features, tools and development practices",
      "Mentor junior developers and contribute to internal development standards"
    ],
    "workSettings": "remote",
    "roleCategory": "developer",
    "qualifications": [
      "Strong hands-on development experience with Dynamics NAV and Business Central (AL and C/AL)",
      "Proven experience working in a Microsoft Partner or consultancy environment",
      "Solid understanding of Business Central architecture and best practice coding standards",
      "Experience with API integrations, web services and extensions",
      "Strong problem-solving skills and attention to detail",
      "Excellent communication skills and ability to work collaboratively with cross-functional teams"
    ],
    "companyLogo": "",
    "companyName": "",
    "minSalary": 70000.0,
    "maxSalary": 75000.0,
    "postedDate": "2025-08-20T03:58:51.484935",
    "category": "developer",
    "updatedAt": "2025-08-20T03:58:51.484935"
  }
]